{
  "professionalExperiences": [
    {
      "title": "Mobile and Website Developer at MomentumIas",
      "description": "Professionally managing MomentumIAS's website, a premier coaching institute for UPSC preparation. Providing comprehensive technical support and maintenance to ensure seamless operations and enhanced user experience across all platforms.",
      "duration": "3 months",
      "dateRange": "Sept/2024 - Present"
    },
    {
      "title": "Jr. Flutter Developer at Hostbooks",
      "description": "Led frontend development for HostBooks business management application, implementing responsive solutions for desktop and mobile platforms. Utilized GetX state management and MVC architecture to deliver high-performance, scalable applications. Collaborated with cross-functional teams to ensure optimal user experience and maintainable codebase.",
      "duration": "4 month",
      "dateRange": "Sept/2022 - Jan/2023"
    },
    {
      "title": "Flutter Intern at Oyelabs",
      "description": "Contributed to Oyelabs grocery application project, which featured an aesthetically appealing user interface designed in Figma. My role involved implementing RESTful APIs, integrated Firebase for backend functionality, and incorporated Google Maps for location-based services.",
      "duration": "5 months",
      "dateRange": "Apirl/2022 - Sept/2022"
    }
    
  ],
  "academicExperiences": [
    {
      "institution": "National Institute of Technology",
      "area": "Computer Science and Engineering",
      "summary": "Graduated with a Bachelor's degree in Computer Science and Engineering",
      "studyType": "Bachelor's",
      "startDate": "2017",
      "endDate": "2021",
      "duration": "4 years"
    },
    {
      "institution": "Kendriya Vidyalaya No. 1 Roorkee",
      "area": "Science",
      "summary": "Completed Higher Secondary Education with Science stream",
      "studyType": "Higher Secondary",
      "startDate": "2015",
      "endDate": "2017",
      "duration": "2 years"
    },
    {
      "institution": "London App Brewery",
      "area": "Flutter Development Training",
      "summary": "After completing my third year of college, I used my summer vacation to learn new technologies and applied my Knowledge in flutter development. I also explored new tools to enhance my ability to build college projects, such as a MarketPlace application.",
      "studyType": "Training",
      "startDate": "May/2020",
      "endDate": "July/2020",
      "duration": "2 months"
    } 
  ]
}